/**
 * Дмитрий Солонников, ДЗ №1, 27.05.2019
 *
 * 0. Создать пустой проект в IntelliJ IDEA и прописать метод main().
 * 1. Создать переменные всех пройденных типов данных и инициализировать их значения.
 * 2. Написать метод вычисляющий выражение a * (b + (c / d)) и возвращающий результат,
 * где a, b, c, d – входные параметры этого метода.
 * 3. Написать метод, принимающий на вход два числа и проверяющий, что их сумма лежит в пределах от 10 до 20 (включительно),
 * если да – вернуть true, в противном случае – false.
 * 4. Написать метод, которому в качестве параметра передается целое число, метод должен напечатать в консоль, положительное
 * ли число передали или отрицательное. Замечание: ноль считаем положительным числом.
 * 5. Написать метод, которому в качестве параметра передается целое число. Метод должен вернуть true, если число отрицательное.
 * 6. Написать метод, которому в качестве параметра передается строка, обозначающая имя. Метод должен вывести в консоль
 * сообщение «Привет, указанное_имя!».
 * 7*. Написать метод, который определяет, является ли год високосным, и выводит сообщение в консоль.
 * Каждый 4-й год является високосным, кроме каждого 100-го, при этом каждый 400-й – високосный.
 */
